Hi @watsonjm , Thanks for the issue.  The provider has not responded for such a long time, it should have lost the connection to the FortiGate. In this case, can you access your FortiGate device from the computer running Terraform? E.g:

```
# curl -k  https://192.168.52.177:2127
```
with response similar to below:
```
<html>
<script language=javascript>

top.location="/ng";

</script>
</html>
```

I tested with your configuration, it worked well. Your configuration should be OK.  **Verification:**
```
# cat var.tfvars
allowed_urls = [
  "go.microsoft.com",
  "wdcp.microsoft.com",
]

# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token    = "XXXXXXXXXXXXXXXXXXXXXX"
  insecure = true
}

variable "allowed_urls" {}

resource "fortios_firewall_object_address" "allowed_url" {
  for_each = toset(var.allowed_urls)
  name     = each.value
  type     = "fqdn"
  fqdn     = each.value
  comment  = "Created in Terraform"
}

resource "fortios_firewall_object_addressgroup" "allowed_urls" {
  name       = "Allowed URLs"
  member     = values(fortios_firewall_object_address.allowed_url)[*].name
  comment    = "Created in Terraform"
  depends_on = [fortios_firewall_object_address.allowed_url]
}
```
```
FOSDEV# terraform plan -var-file="var.tfvars"
.....................

FOSDEV# terraform apply -var-file="var.tfvars"
2020/06/18 16:28:36 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_object_address.allowed_url["go.microsoft.com"] will be created
  + resource "fortios_firewall_object_address" "allowed_url" {
      + associated_interface   = (known after apply)
      + comment                = "Created in Terraform"
      + country                = (known after apply)
      + end_ip                 = (known after apply)
      + fqdn                   = "go.microsoft.com"
      + id                     = (known after apply)
      + name                   = "go.microsoft.com"
      + show_in_address_list   = (known after apply)
      + start_ip               = (known after apply)
      + static_route_configure = (known after apply)
      + subnet                 = (known after apply)
      + type                   = "fqdn"
    }

  # fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"] will be created
  + resource "fortios_firewall_object_address" "allowed_url" {
      + associated_interface   = (known after apply)
      + comment                = "Created in Terraform"
      + country                = (known after apply)
      + end_ip                 = (known after apply)
      + fqdn                   = "wdcp.microsoft.com"
      + id                     = (known after apply)
      + name                   = "wdcp.microsoft.com"
      + show_in_address_list   = (known after apply)
      + start_ip               = (known after apply)
      + static_route_configure = (known after apply)
      + subnet                 = (known after apply)
      + type                   = "fqdn"
    }

  # fortios_firewall_object_addressgroup.allowed_urls will be created
  + resource "fortios_firewall_object_addressgroup" "allowed_urls" {
      + comment = "Created in Terraform"
      + id      = (known after apply)
      + member  = [
          + "go.microsoft.com",
          + "wdcp.microsoft.com",
        ]
      + name    = "Allowed URLs"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_object_address.allowed_url["go.microsoft.com"]: Creating...
fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"]: Creating...
fortios_firewall_object_address.allowed_url["go.microsoft.com"]: Creation complete after 0s [id=go.microsoft.com]
fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"]: Creation complete after 0s [id=wdcp.microsoft.com]
fortios_firewall_object_addressgroup.allowed_urls: Creating...
fortios_firewall_object_addressgroup.allowed_urls: Creation complete after 0s [id=Allowed URLs]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```
```
FOSDEV# terraform destroy -var-file="var.tfvars"
2020/06/18 16:28:46 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
fortios_firewall_object_address.allowed_url["go.microsoft.com"]: Refreshing state... [id=go.microsoft.com]
fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"]: Refreshing state... [id=wdcp.microsoft.com]
fortios_firewall_object_addressgroup.allowed_urls: Refreshing state... [id=Allowed URLs]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # fortios_firewall_object_address.allowed_url["go.microsoft.com"] will be destroyed
  - resource "fortios_firewall_object_address" "allowed_url" {
      - comment                = "Created in Terraform" -> null
      - fqdn                   = "go.microsoft.com" -> null
      - id                     = "go.microsoft.com" -> null
      - name                   = "go.microsoft.com" -> null
      - show_in_address_list   = "enable" -> null
      - static_route_configure = "disable" -> null
      - type                   = "fqdn" -> null
    }

  # fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"] will be destroyed
  - resource "fortios_firewall_object_address" "allowed_url" {
      - comment                = "Created in Terraform" -> null
      - fqdn                   = "wdcp.microsoft.com" -> null
      - id                     = "wdcp.microsoft.com" -> null
      - name                   = "wdcp.microsoft.com" -> null
      - show_in_address_list   = "enable" -> null
      - static_route_configure = "disable" -> null
      - type                   = "fqdn" -> null
    }

  # fortios_firewall_object_addressgroup.allowed_urls will be destroyed
  - resource "fortios_firewall_object_addressgroup" "allowed_urls" {
      - comment = "Created in Terraform" -> null
      - id      = "Allowed URLs" -> null
      - member  = [
          - "go.microsoft.com",
          - "wdcp.microsoft.com",
        ] -> null
      - name    = "Allowed URLs" -> null
    }

Plan: 0 to add, 0 to change, 3 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

fortios_firewall_object_addressgroup.allowed_urls: Destroying... [id=Allowed URLs]
fortios_firewall_object_addressgroup.allowed_urls: Destruction complete after 0s
fortios_firewall_object_address.allowed_url["go.microsoft.com"]: Destroying... [id=go.microsoft.com]
fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"]: Destroying... [id=wdcp.microsoft.com]
fortios_firewall_object_address.allowed_url["wdcp.microsoft.com"]: Destruction complete after 0s
fortios_firewall_object_address.allowed_url["go.microsoft.com"]: Destruction complete after 0s

Destroy complete! Resources: 3 destroyed.

```
In addition, regarding the problem of the delay of more than ten hours, we will improve the delay design ASAP to avoid excessive waiting. Thank you!

